[Timeout] StringLiteral
src/components/Pokemon.tsx:21:40
   return (
     <div className="pokemon">
       <div className="pokemon-overview">
-        <p data-testid="pokemon-name">{`${name}`}</p>
+        <p data-testid="pokemon-name">{``}</p>
         <p data-testid="pokemon-type">{`${type}`}</p>
         <p data-testid="pokemon-weight">

[Timeout] StringLiteral
src/components/Pokemon.tsx:33:17
         <img
           className="favorite-icon"
           src="/star-icon.svg"
-          alt={ `${name} is marked as favorite` }
+          alt={ `` }
         />
       )}
